//Напишіть функцію mapObject, яка
//у чомусь схожа на функцію map для масивів.
//
//Ця функція повинна приймати об'єкт джаваскрипту
//і функцію transformer, яку потрібно застосувати до кожного з полів об'єкта,
//...а з результату застосування функції transformer до кожного поля вхідного об'єкта
//зібрати новий об'єкт та повернути його.
//
//Так наприклад, можна буде замепити об'єкт типу
//{ "roma" : 5, "vasya": 2 } оцінок студентів
//на функцію на кшталт (x) => x > 2
//щоб отримати об'єкт
//{"roma": true, "vasya": false} заліків студентів
//
//Зрозуміло для опису сигнатури mapObject треба буде юзать
//1) дженерики з кількома параметрами-типами
//2) таку штуку як Record (globalThis.Record, якщо бути точним ;) )



function mapObject<T, U> (obj: Record<string, T>, transformer:(val:T) => U): Record<string, U>{

}