"use strict";
//хакатон на ШВИДКІСТЬ! кодимо брудно, засікаємо таймер!
//
//завдання: зробити сайт з двома кнопками, Плюс та Мінус
//при натисканні на кнопки повинен надсилатися запит на бекенд
//у вигляді json, але при цьому як на фронті, так і на бекенді
//саме enum'и повинні описувати кнопку, яка була натиснута.
//бекенд повинен повертати на фронтенд кількість натискань однієї та іншої кнопки
//уникайте типу number або string, тільки enum!
//фронтенд якось повинен відобразити ці дані.
//
//частину часу у вас займе налаштування середовища з тайпскриптом
//як для фронту, так і для бека
//не копіюйте існуюче середовище, яке вже прям налаштовано
//робіть все з нуля (ну або з шаблонів в інеті).
//
//час, витрачений на це завдання, має бути мінімальним.
//ходять чутки, що все можна зробити за 5 хвилин...))
//якісний код не приймається, потрібно вирішувати максимально швидко
//та максимально брудно.
//
//в кінці постимо в чат дані з секундоміра ;)
Object.defineProperty(exports, "__esModule", { value: true });
var express_1 = require("express");
var app = (0, express_1.default)();
var port = 3000;
var plus = 0;
var minus = 0;
app.use(express_1.default.json());
app.use(express_1.default.static("public"));
app.post("/", function (req, res) {
    if (req.body.operator === "PLUS" /* Buttons.Plus */) {
        plus++;
        res.json({ count: plus });
    }
    else {
        minus++;
        res.json({ count: minus });
    }
});
app.listen(port, function () {
    console.log("Server started");
});
