//хакатон на ШВИДКІСТЬ! кодимо брудно, засікаємо таймер!
//
//завдання: зробити сайт з двома кнопками, Плюс та Мінус
//при натисканні на кнопки повинен надсилатися запит на бекенд
//у вигляді json, але при цьому як на фронті, так і на бекенді
//саме enum'и повинні описувати кнопку, яка була натиснута.
//бекенд повинен повертати на фронтенд кількість натискань однієї та іншої кнопки
//уникайте типу number або string, тільки enum!
//фронтенд якось повинен відобразити ці дані.
//
//частину часу у вас займе налаштування середовища з тайпскриптом
//як для фронту, так і для бека
//не копіюйте існуюче середовище, яке вже прям налаштовано
//робіть все з нуля (ну або з шаблонів в інеті).
//
//час, витрачений на це завдання, має бути мінімальним.
//ходять чутки, що все можна зробити за 5 хвилин...))
//якісний код не приймається, потрібно вирішувати максимально швидко
//та максимально брудно.
//
//в кінці постимо в чат дані з секундоміра ;)

import express from "express"

const app = express()
const port = 3000;
let plus = 0;
let minus = 0;

const enum Buttons {
  Plus = "PLUS",
  Minus = "MINUS"
}

app.use(express.json())
app.use(express.static("public"));

app.post("/", (req, res) => { 
  if(req.body.operator === Buttons.Plus){
    plus++
    res.json({count: plus})
  } else {
    minus++
    res.json({count: minus})
  }  
})

app.listen(port, () => {
  console.log("Server started");
})